23/UddiInquiry/sample_company.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><businessDetail generic="1.0" operator="Microsoft Corporation" truncated="false" xmlns="urn:uddi-org:api"><businessEntity businessKey="59593094-df1d-4f53-9a2c-8bffc8c93513" operator="Microsoft Corporation" authorizedName="Scott Witkin"><discoveryURLs><discoveryURL useType="businessEntity">http://uddi.microsoft.com/discovery?businessKey=59593094-df1d-4f53-9a2c-8bffc8c93513</discoveryURL></discoveryURLs><name>MicroFocus</name><description xml:lang="en" /><contacts><contact useType=""><description xml:lang="en" /><personName>Scott Witkin</personName><phone useType="Business">301-555-1212</phone><email useType="Business">myemail@microfocus.com</email><address useType="Business"><addressLine>Micro Focus</addressLine><addressLine>9420 Key West Ave</addressLine><addressLine>,</addressLine></address></contact></contacts><businessServices><businessService serviceKey="520904a7-3d9a-49b6-8875-3668fa058f6b" businessKey="59593094-df1d-4f53-9a2c-8bffc8c93513"><name>QueryMaster</name><description xml:lang="en">QueryMaster</description><bindingTemplates><bindingTemplate bindingKey="be74d207-c89a-4d53-9688-2be5b3d66c93" serviceKey="520904a7-3d9a-49b6-8875-3668fa058f6b"><accessPoint URLType="http">http://rock-scottw:9080/soapambcgJBQueryMaster/servlet/rpcrouter</accessPoint><tModelInstanceDetails><tModelInstanceInfo tModelKey="uuid:0375c000-302e-4e48-a8b6-7207a5554780" /></tModelInstanceDetails></bindingTemplate></bindingTemplates></businessService></businessServices></businessEntity></businessDetail></soap:Body></soap:Envelope>