23/UddiInquiry/company.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><businessDetail generic="1.0" operator="Microsoft Corporation" truncated="false" xmlns="urn:uddi-org:api"><businessEntity businessKey="cbca05fb-277d-4b7e-a101-e6925b376c18" operator="Microsoft Corporation" authorizedName="UDDI Test account"><discoveryURLs><discoveryURL useType="businessEntity">http://test.uddi.microsoft.com/discovery?businesskey=cbca05fb-277d-4b7e-a101-e6925b376c18</discoveryURL></discoveryURLs><name>Microsoft Corporation</name><description xml:lang="en">Empowering people through great software - any time, any place and on any device is Microsofts vision. As the worldwide leader in software for personal and business computing, we strive to produce innovative products and services that meet our customer's</description><contacts><contact useType="Corporate Addresses and telephon"><description xml:lang="en">Corporate Mailing Addresses</description><personName>unspecified</personName><phone useType="Corporate Headquarters">(425) 882-8080</phone><address sortCode="~" useType="Corporate Headquarters"><addressLine>Microsoft Corporation</addressLine><addressLine>One Microsoft Way</addressLine><addressLine>Redmond, WA 98052-6399</addressLine><addressLine>USA</addressLine></address></contact><contact useType="Technical Contact - Corporate UD"><description xml:lang="en">World Wide Operations</description><personName>Martin Kohlleppel</personName><email>martink@microsoft.com</email></contact></contacts><businessServices><businessService serviceKey="5f73eff6-7a85-41cf-99d9-66cda3a82e63" businessKey="cbca05fb-277d-4b7e-a101-e6925b376c18"><name>UDDI Web Sites</name><description xml:lang="en">UDDI Registry Web Sites</description><bindingTemplates><bindingTemplate bindingKey="cf9eae1b-886e-4d8d-81d3-316f584faef7" serviceKey="5f73eff6-7a85-41cf-99d9-66cda3a82e63"><description xml:lang="en">Microsoft Production UDDI Registry Web Site</description><accessPoint URLType="http">http://uddi.microsoft.com</accessPoint><tModelInstanceDetails><tModelInstanceInfo tModelKey="uuid:4cd7e4bc-648b-426d-9936-443eaac8ae23"><description xml:lang="en">UDDI Inquiry Service Type</description><instanceDetails><description xml:lang="en">SOAP URL for inquire</description><instanceParms>http://uddi.microsoft.com/inquire</instanceParms></instanceDetails></tModelInstanceInfo><tModelInstanceInfo tModelKey="uuid:64c756d1-3374-4e00-ae83-ee12e38fae63"><description xml:lang="en">UDDI Inquiry Publication Type</description><instanceDetails><description xml:lang="en">SOAP URL for publication</description><instanceParms>https://uddi.microsoft.com/publish</instanceParms></instanceDetails></tModelInstanceInfo></tModelInstanceDetails></bindingTemplate><bindingTemplate bindingKey="0fd101f7-7049-4851-b3f4-acdd3bd31c4f" serviceKey="5f73eff6-7a85-41cf-99d9-66cda3a82e63"><description xml:lang="en">Microsoft Test UDDI Registry Web Site</description><accessPoint URLType="http">http://test.uddi.microsoft.com</accessPoint><tModelInstanceDetails><tModelInstanceInfo tModelKey="uuid:4cd7e4bc-648b-426d-9936-443eaac8ae23"><description xml:lang="en">UDDI Inquiry Service Type</description><instanceDetails><description xml:lang="en">SOAP URL for inquire</description><instanceParms>http://test.uddi.microsoft.com/inquire</instanceParms></instanceDetails></tModelInstanceInfo><tModelInstanceInfo tModelKey="uuid:64c756d1-3374-4e00-ae83-ee12e38fae63"><description xml:lang="en">UDDI Inquiry Publication Type</description><instanceDetails><description xml:lang="en">SOAP URL for publication</description><instanceParms>https://test.uddi.microsoft.com/publish</instanceParms></instanceDetails></tModelInstanceInfo></tModelInstanceDetails></bindingTemplate></bindingTemplates></businessService><businessService serviceKey="be1a0b34-e2f1-4f4b-aae6-258c338ae358" businessKey="cbca05fb-277d-4b7e-a101-e6925b376c18"><name>UDDI Web Services</name><description xml:lang="en">UDDI SOAP/XML message-based programmatic web service interfaces.</description><bindingTemplates><bindingTemplate bindingKey="00cbd2b2-2333-4f85-b144-369be3d95f7c" serviceKey="be1a0b34-e2f1-4f4b-aae6-258c338ae358"><description xml:lang="en">Production UDDI server, Publishing interface</description><accessPoint URLType="https">https://uddi.microsoft.com/publish</accessPoint><tModelInstanceDetails><tModelInstanceInfo tModelKey="uuid:64c756d1-3374-4e00-ae83-ee12e38fae63"><description xml:lang="en">UDDI SOAP Publication Interface</description></tModelInstanceInfo></tModelInstanceDetails></bindingTemplate><bindingTemplate bindingKey="7311552e-3421-4431-8fcb-e7f398be8424" serviceKey="be1a0b34-e2f1-4f4b-aae6-258c338ae358"><description xml:lang="en">Production UDDI server, Inquiry interface</description><accessPoint URLType="http">http://uddi.microsoft.com/inquire</accessPoint><tModelInstanceDetails><tModelInstanceInfo tModelKey="uuid:4cd7e4bc-648b-426d-9936-443eaac8ae23"><description xml:lang="en">UDDI SOAP Inquiry Interface</description></tModelInstanceInfo></tModelInstanceDetails></bindingTemplate><bindingTemplate bindingKey="569209fa-e1cd-4604-bfca-a29fffaebbd6" serviceKey="be1a0b34-e2f1-4f4b-aae6-258c338ae358"><description xml:lang="en">Test UDDI server, Publishing interface</description><accessPoint URLType="https">https://test.uddi.microsoft.com/publish</accessPoint><tModelInstanceDetails><tModelInstanceInfo tModelKey="uuid:64c756d1-3374-4e00-ae83-ee12e38fae63"><description xml:lang="en">UDDI SOAP Publication Interface</description></tModelInstanceInfo></tModelInstanceDetails></bindingTemplate><bindingTemplate bindingKey="9a9ad5d1-6904-494a-a0ea-ad9a9c0cfeb5" serviceKey="be1a0b34-e2f1-4f4b-aae6-258c338ae358"><description xml:lang="en">Test UDDI server, Inquiry interface</description><accessPoint URLType="http">http://test.uddi.microsoft.com/inquire</accessPoint><tModelInstanceDetails><tModelInstanceInfo tModelKey="uuid:4cd7e4bc-648b-426d-9936-443eaac8ae23"><description xml:lang="en">UDDI SOAP Inquiry Interface</description></tModelInstanceInfo></tModelInstanceDetails></bindingTemplate></bindingTemplates><categoryBag><keyedReference tModelKey="uuid:a035a07c-f362-44dd-8f95-e2b134bf43b4" keyName="KEYWORD" keyValue="API" /><keyedReference tModelKey="uuid:a035a07c-f362-44dd-8f95-e2b134bf43b4" keyName="KEYWORD" keyValue="SOAP" /><keyedReference tModelKey="uuid:a035a07c-f362-44dd-8f95-e2b134bf43b4" keyName="KEYWORD" keyValue="XML" /></categoryBag></businessService><businessService serviceKey="e00c9102-b0e9-4b2c-9977-e4f300cc86d9" businessKey="cbca05fb-277d-4b7e-a101-e6925b376c18"><name>Home Page</name><description xml:lang="en">Corporate Home Page</description><bindingTemplates><bindingTemplate bindingKey="24e9963b-16fc-4d6c-887d-53d9752be09b" serviceKey="e00c9102-b0e9-4b2c-9977-e4f300cc86d9"><description xml:lang="en">Corporate Home Page URL</description><accessPoint URLType="http">http://www.microsoft.com</accessPoint><tModelInstanceDetails><tModelInstanceInfo tModelKey="uuid:68de9e80-ad09-469d-8a37-088422bfbc36"><description xml:lang="en">HTTP Address</description></tModelInstanceInfo></tModelInstanceDetails></bindingTemplate></bindingTemplates></businessService><businessService serviceKey="30a4e6ee-6d6b-44b2-bf5a-656a1b8f2562" businessKey="cbca05fb-277d-4b7e-a101-e6925b376c18"><name>Online Shopping</name><description xml:lang="en">This site is designed to help you easily learn about and order Microsoft® software and hardware and Microsoft Press® titles that can enhance your computing.</description><bindingTemplates><bindingTemplate bindingKey="0fca47d6-e2e4-4fbd-baec-a424bc861acf" serviceKey="30a4e6ee-6d6b-44b2-bf5a-656a1b8f2562"><description xml:lang="en">eShop web site</description><accessPoint URLType="http">http://shop.microsoft.com</accessPoint><tModelInstanceDetails><tModelInstanceInfo tModelKey="uuid:68de9e80-ad09-469d-8a37-088422bfbc36"><description xml:lang="en">HTTP Address</description></tModelInstanceInfo></tModelInstanceDetails></bindingTemplate></bindingTemplates></businessService><businessService serviceKey="5683fe5f-fa56-4354-b42f-0378578caf2b" businessKey="cbca05fb-277d-4b7e-a101-e6925b376c18"><name>Microsoft Developer Network</name><description xml:lang="en">MSDN, the Microsoft Developer Network, is the essential resource for developers. MSDN developer programs make it easy to find timely, comprehensive development resources, including software subscription programs, technical information, Web sites, and conf</description><bindingTemplates><bindingTemplate bindingKey="14272fe7-4629-4710-a723-eaba1d37e8cb" serviceKey="5683fe5f-fa56-4354-b42f-0378578caf2b"><description xml:lang="en">MSDN Web Site</description><accessPoint URLType="http">http://msdn.microsoft.com</accessPoint><tModelInstanceDetails><tModelInstanceInfo tModelKey="uuid:68de9e80-ad09-469d-8a37-088422bfbc36"><description xml:lang="en">HTTP Address</description></tModelInstanceInfo></tModelInstanceDetails></bindingTemplate></bindingTemplates></businessService><businessService serviceKey="b0997f2c-b4c1-4afc-ba90-558369abd856" businessKey="cbca05fb-277d-4b7e-a101-e6925b376c18"><name>Technet</name><description xml:lang="en">TechNet provides in depth "how-to" technical information on Microsoft products as well as a chance to interact with peers — and Microsoft. You can access forums for sharing best practices with others and provide feedback directly to Microsoft regarding fu</description><bindingTemplates><bindingTemplate bindingKey="20c01b55-d5a3-4b1c-9fd9-037ba0148f6b" serviceKey="b0997f2c-b4c1-4afc-ba90-558369abd856"><description xml:lang="en">Technet web site</description><accessPoint URLType="http">http://www.microsoft.com/technet</accessPoint><tModelInstanceDetails><tModelInstanceInfo tModelKey="uuid:68de9e80-ad09-469d-8a37-088422bfbc36"><description xml:lang="en">HTTP Address</description></tModelInstanceInfo></tModelInstanceDetails></bindingTemplate></bindingTemplates></businessService><businessService serviceKey="e82bd87f-2798-4806-b844-f40f36696bc4" businessKey="cbca05fb-277d-4b7e-a101-e6925b376c18"><name>Volume Licensing Select Program</name><description xml:lang="en">The select program for volume licensing user guide for the Select CD application.</description><bindingTemplates><bindingTemplate bindingKey="c64817b8-ffd2-4c13-94bd-09a2ccd4fbf8" serviceKey="e82bd87f-2798-4806-b844-f40f36696bc4"><description xml:lang="en">Volume Licensing Select Web Site</description><accessPoint URLType="http">http://selectug.mslicense.com</accessPoint><tModelInstanceDetails><tModelInstanceInfo tModelKey="uuid:68de9e80-ad09-469d-8a37-088422bfbc36"><description xml:lang="en">HTTP Address</description></tModelInstanceInfo></tModelInstanceDetails></bindingTemplate></bindingTemplates></businessService><businessService serviceKey="41927bf2-0c8a-4bd2-968c-5dbbac793166" businessKey="cbca05fb-277d-4b7e-a101-e6925b376c18"><name>Electronic Business Integration Services</name><description xml:lang="en">EBIS EDI information</description><bindingTemplates><bindingTemplate bindingKey="0329ceec-9e5a-489a-865d-cf64fd2c6649" serviceKey="41927bf2-0c8a-4bd2-968c-5dbbac793166"><description xml:lang="en">EBIS overview web site</description><accessPoint URLType="http">http://www.microsoft.com/edi</accessPoint><tModelInstanceDetails><tModelInstanceInfo tModelKey="uuid:68de9e80-ad09-469d-8a37-088422bfbc36"><description xml:lang="en">HTTP Address</description></tModelInstanceInfo></tModelInstanceDetails></bindingTemplate></bindingTemplates></businessService><businessService serviceKey="7ebf42b7-22ea-4d04-a95b-eef687f81bae" businessKey="cbca05fb-277d-4b7e-a101-e6925b376c18"><name>Web services for smart searching</name><description xml:lang="en">These services provide support for smarter resolution of mistyped URLS for web sites.</description><bindingTemplates><bindingTemplate bindingKey="c438eadb-1ec5-48b7-97ea-bf2c76892f60" serviceKey="7ebf42b7-22ea-4d04-a95b-eef687f81bae"><description xml:lang="en">Vocabulary: takes in a phrase and provides a synonym resolution to vocabulary terms</description><accessPoint URLType="http">http://beta.search.microsoft.com/search/mscomsearchservice.asmx</accessPoint><tModelInstanceDetails><tModelInstanceInfo tModelKey="uuid:c90d731d-777d-4130-9de3-5303371170c2"><description xml:lang="en">microsoft-com:disco</description></tModelInstanceInfo></tModelInstanceDetails></bindingTemplate><bindingTemplate bindingKey="b88c7bc0-a108-49ad-8dbd-ad95feacba96" serviceKey="7ebf42b7-22ea-4d04-a95b-eef687f81bae"><description xml:lang="en">Best Bets: takes in a search keyword and returns URLS that are close matches.</description><accessPoint URLType="http">http://beta.search.microsoft.com/search/mscomsearchservice.asmx</accessPoint><tModelInstanceDetails><tModelInstanceInfo tModelKey="uuid:c90d731d-777d-4130-9de3-5303371170c2"><description xml:lang="en">microsoft-com:disco</description></tModelInstanceInfo></tModelInstanceDetails></bindingTemplate></bindingTemplates></businessService></businessServices><identifierBag><keyedReference tModelKey="uuid:8609c81e-ee1f-4d5a-b202-3eb13ad01823" keyName="D-U-N-S" keyValue="08-146-6849" /></identifierBag><categoryBag><keyedReference tModelKey="uuid:c0b9fe13-179f-413d-8a5b-5004db8e5bb2" keyName="NAICS: Software Publisher" keyValue="51121" /></categoryBag></businessEntity></businessDetail></soap:Body></soap:Envelope>